[Killed] BlockStatement
src/gilded_rose.mjs:2:38
 export class Item {
-  constructor(name, sellIn, quality) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = name === "Sulfuras, Hand of Ragnaros" ? 80 : quality;
-  }
+  constructor(name, sellIn, quality) {}
 
   incQuality(n) {
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected undefined to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:5:20
   constructor(name, sellIn, quality) {
     this.name = name;
     this.sellIn = sellIn;
-    this.quality = name === "Sulfuras, Hand of Ragnaros" ? 80 : quality;
+    this.quality = false ? 80 : quality;
   }
 
killedBy: Gilded Rose Sulfuras is constantly 80 points
statusReason: expected 5 to equal 80

[Killed] ConditionalExpression
src/gilded_rose.mjs:5:20
   constructor(name, sellIn, quality) {
     this.name = name;
     this.sellIn = sellIn;
-    this.quality = name === "Sulfuras, Hand of Ragnaros" ? 80 : quality;
+    this.quality = true ? 80 : quality;
   }
 
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected 79 to equal 4

[Killed] BlockStatement
src/gilded_rose.mjs:8:17
     this.quality = name === "Sulfuras, Hand of Ragnaros" ? 80 : quality;
   }
 
-  incQuality(n) {
-    while (n-- > 0 && this.quality < 50) this.quality++;
-  }
+  incQuality(n) {}
 
   decQuality(n) {
killedBy: Gilded Rose Aged Brie has peak quality at 50, sellIn decreases
statusReason: expected 46 to equal 47

[Killed] UpdateOperator
src/gilded_rose.mjs:9:12
   }
 
   incQuality(n) {
-    while (n-- > 0 && this.quality < 50) this.quality++;
+    while (n++ > 0 && this.quality < 50) this.quality++;
   }
 
killedBy: Gilded Rose Aged Brie has peak quality at 50, sellIn decreases
statusReason: expected 50 to equal 47

[Killed] ConditionalExpression
src/gilded_rose.mjs:9:23
   }
 
   incQuality(n) {
-    while (n-- > 0 && this.quality < 50) this.quality++;
+    while (n-- > 0 && true) this.quality++;
   }
 
killedBy: Gilded Rose Aged Brie has peak quality at 50, sellIn decreases
statusReason: expected 51 to equal 50

[Killed] BlockStatement
src/gilded_rose.mjs:12:17
     while (n-- > 0 && this.quality < 50) this.quality++;
   }
 
-  decQuality(n) {
-    while (n-- > 0 && this.quality > 0) this.quality--;
-  }
+  decQuality(n) {}
 }
 
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected 5 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:13:12
   }
 
   decQuality(n) {
-    while (n-- > 0 && this.quality > 0) this.quality--;
+    while (false) this.quality--;
   }
 }
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected 5 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:13:23
   }
 
   decQuality(n) {
-    while (n-- > 0 && this.quality > 0) this.quality--;
+    while (n-- > 0 && true) this.quality--;
   }
 }
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected -1 to equal +0

[Killed] ArrayDeclaration
src/gilded_rose.mjs:18:23
 }
 
 export class Shop {
-  constructor(items = []) {
+  constructor(items = ["Stryker was here"]) {
     this.items = items;
   }
killedBy: Gilded Rose empty Shop
statusReason: expected [Function doingEmpty] to not throw an error but 'TypeError: Cannot create property \'s…' was thrown

[Killed] ConditionalExpression
src/gilded_rose.mjs:25:9
   updateQuality() {
     for (const item of this.items) {
       switch (item.name) {
-        case "Aged Brie":
-          item.incQuality(--item.sellIn < 0 ? 2 : 1);
-          break;
+        case "Aged Brie":
 
         case "Backstage passes to a TAFKAL80ETC concert":
killedBy: Gilded Rose Aged Brie has peak quality at 50, sellIn decreases
statusReason: expected 49 to equal 47

[Killed] UpdateOperator
src/gilded_rose.mjs:26:27
     for (const item of this.items) {
       switch (item.name) {
         case "Aged Brie":
-          item.incQuality(--item.sellIn < 0 ? 2 : 1);
+          item.incQuality(++item.sellIn < 0 ? 2 : 1);
           break;
 
killedBy: Gilded Rose Aged Brie has peak quality at 50, sellIn decreases
statusReason: expected 6 to equal 4

[Killed] EqualityOperator
src/gilded_rose.mjs:26:27
     for (const item of this.items) {
       switch (item.name) {
         case "Aged Brie":
-          item.incQuality(--item.sellIn < 0 ? 2 : 1);
+          item.incQuality(--item.sellIn >= 0 ? 2 : 1);
           break;
 
killedBy: Gilded Rose Aged Brie has peak quality at 50, sellIn decreases
statusReason: expected 48 to equal 47

[Killed] ConditionalExpression
src/gilded_rose.mjs:29:9
           item.incQuality(--item.sellIn < 0 ? 2 : 1);
           break;
 
-        case "Backstage passes to a TAFKAL80ETC concert":
-          const expiry = item.sellIn--;
-
-          if (item.sellIn < 0) item.quality = 0;
-          else if (expiry < 6) item.incQuality(3);
-          else if (expiry < 11) item.incQuality(2);
-          else item.incQuality(1);
-          break;
+        case "Backstage passes to a TAFKAL80ETC concert":
 
         case "Conjured":
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 28 to equal 31

[Killed] StringLiteral
src/gilded_rose.mjs:29:14
           item.incQuality(--item.sellIn < 0 ? 2 : 1);
           break;
 
-        case "Backstage passes to a TAFKAL80ETC concert":
+        case "":
           const expiry = item.sellIn--;
 
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 29 to equal 31

[Killed] UpdateOperator
src/gilded_rose.mjs:30:26
           break;
 
         case "Backstage passes to a TAFKAL80ETC concert":
-          const expiry = item.sellIn--;
+          const expiry = item.sellIn++;
 
           if (item.sellIn < 0) item.quality = 0;
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 12 to equal 10

[Killed] ConditionalExpression
src/gilded_rose.mjs:32:15
         case "Backstage passes to a TAFKAL80ETC concert":
           const expiry = item.sellIn--;
 
-          if (item.sellIn < 0) item.quality = 0;
+          if (false) item.quality = 0;
           else if (expiry < 6) item.incQuality(3);
           else if (expiry < 11) item.incQuality(2);
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 50 to equal +0

[Killed] ConditionalExpression
src/gilded_rose.mjs:32:15
         case "Backstage passes to a TAFKAL80ETC concert":
           const expiry = item.sellIn--;
 
-          if (item.sellIn < 0) item.quality = 0;
+          if (true) item.quality = 0;
           else if (expiry < 6) item.incQuality(3);
           else if (expiry < 11) item.incQuality(2);
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected +0 to equal 31

[Killed] EqualityOperator
src/gilded_rose.mjs:33:20
           const expiry = item.sellIn--;
 
           if (item.sellIn < 0) item.quality = 0;
-          else if (expiry < 6) item.incQuality(3);
+          else if (expiry >= 6) item.incQuality(3);
           else if (expiry < 11) item.incQuality(2);
           else item.incQuality(1);
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 33 to equal 31

[Killed] ConditionalExpression
src/gilded_rose.mjs:33:20
           const expiry = item.sellIn--;
 
           if (item.sellIn < 0) item.quality = 0;
-          else if (expiry < 6) item.incQuality(3);
+          else if (false) item.incQuality(3);
           else if (expiry < 11) item.incQuality(2);
           else item.incQuality(1);
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 43 to equal 44

[Killed] ConditionalExpression
src/gilded_rose.mjs:34:20
 
           if (item.sellIn < 0) item.quality = 0;
           else if (expiry < 6) item.incQuality(3);
-          else if (expiry < 11) item.incQuality(2);
+          else if (true) item.incQuality(2);
           else item.incQuality(1);
           break;
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 32 to equal 31

[Killed] ConditionalExpression
src/gilded_rose.mjs:34:20
 
           if (item.sellIn < 0) item.quality = 0;
           else if (expiry < 6) item.incQuality(3);
-          else if (expiry < 11) item.incQuality(2);
+          else if (false) item.incQuality(2);
           else item.incQuality(1);
           break;
killedBy: Gilded Rose Backstage passes behave properly
statusReason: expected 32 to equal 33

[Killed] ConditionalExpression
src/gilded_rose.mjs:38:9
           else item.incQuality(1);
           break;
 
-        case "Conjured":
-          item.decQuality(--item.sellIn < 0 ? 4 : 2);
-          break;
+        case "Conjured":
 
         case "Sulfuras, Hand of Ragnaros":
killedBy: Gilded Rose Conjured items degrade 2x as fast as normal items
statusReason: expected 30 to equal 28

[Killed] EqualityOperator
src/gilded_rose.mjs:39:27
           break;
 
         case "Conjured":
-          item.decQuality(--item.sellIn < 0 ? 4 : 2);
+          item.decQuality(--item.sellIn >= 0 ? 4 : 2);
           break;
 
killedBy: Gilded Rose Conjured items degrade 2x as fast as normal items
statusReason: expected 26 to equal 28

[Killed] ConditionalExpression
src/gilded_rose.mjs:39:27
           break;
 
         case "Conjured":
-          item.decQuality(--item.sellIn < 0 ? 4 : 2);
+          item.decQuality(true ? 4 : 2);
           break;
 
killedBy: Gilded Rose Conjured items degrade 2x as fast as normal items
statusReason: expected 26 to equal 28

[Killed] ConditionalExpression
src/gilded_rose.mjs:42:9
           item.decQuality(--item.sellIn < 0 ? 4 : 2);
           break;
 
-        case "Sulfuras, Hand of Ragnaros":
-          break;
+        case "Sulfuras, Hand of Ragnaros":
 
         default:
killedBy: Gilded Rose Sulfuras is constantly 80 points
statusReason: expected 79 to equal 80

[Killed] ConditionalExpression
src/gilded_rose.mjs:45:9
         case "Sulfuras, Hand of Ragnaros":
           break;
 
-        default:
-          item.decQuality(--item.sellIn < 0 ? 2 : 1);
+        default:
       }
     }
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected 5 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:46:27
           break;
 
         default:
-          item.decQuality(--item.sellIn < 0 ? 2 : 1);
+          item.decQuality(true ? 2 : 1);
       }
     }
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected 3 to equal 4

[Killed] UpdateOperator
src/gilded_rose.mjs:46:27
           break;
 
         default:
-          item.decQuality(--item.sellIn < 0 ? 2 : 1);
+          item.decQuality(++item.sellIn < 0 ? 2 : 1);
       }
     }
killedBy: Gilded Rose ordinary items behave properly
statusReason: expected 3 to equal 1
